src/cfe/api_query/Catalogs/pbi_запросы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>pbi_запросы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Запись</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Разделитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХМЛ_Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХМЛ_Настройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаКлюч</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроизволныйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписейПотоков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество_Пар</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ_Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cfe/api_query/Catalogs/pbi_запросы/Ext/ManagerModule.bsl
#Область Служебные_инструменты

Функция Вернуть_Вариант_поКлючу(Ключ) Экспорт
	
	мРезультат	=	Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВариантыОтчетов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВариантыОтчетов КАК ВариантыОтчетов
	|ГДЕ
	|	ВариантыОтчетов.КлючВарианта = &КлючВарианта";
	
	Запрос.УстановитьПараметр("КлючВарианта", СокрЛП(Ключ));	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		мРезультат = ВыборкаДетальныеЗаписи.ссылка;
	КонецЕсли;
	
	Возврат мРезультат;
	
КонецФункции


Функция Вернуть_Запрос_поИдентификатору(Идентификатор_Запроса,ЭтоОтчет=Ложь) Экспорт
	
	мРезультат	=	Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	pbi_запросы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.pbi_запросы КАК pbi_запросы
	|ГДЕ
	|	pbi_запросы.Идентификатор = &Идентификатор
	|	И НЕ pbi_запросы.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Идентификатор", СокрЛП(Идентификатор_Запроса));
	Запрос.УстановитьПараметр("Отчет", ЭтоОтчет);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		мРезультат = ВыборкаДетальныеЗаписи.ссылка;
	КонецЕсли;
	
	Возврат мРезультат;
	
КонецФункции

Функция ПолучитьТекстМакетаПоУмолчанию() Экспорт
	
	Возврат ПолучитьМакет("Макет_МодульПоУмолчанию").ПолучитьТекст();
	
КонецФункции


#КонецОбласти

#Область ОСНОВНЫЕ_АЛГОРИТМЫ

Функция ЗаписатьДанные(Данные,Представление) Экспорт
	
	Результат = Неопределено; 
	мИдентификатор = AQ_Модуль.Транслит(Представление);	
	
	Если Данные.Количество()>0 Тогда	
		
		//НС	=	Вернуть_Запрос_поИдентификатору(мИдентификатор);
		//Если НС	= Неопределено Тогда		
		//	НС = Справочники.pbi_запросы.СоздатьЭлемент();
		//Иначе
		//	НС = НС.Получитьобъект();			
		//КонецЕсли;		
		//
		//ДвоичныеДанныеMCR = УКО_MCRФормат.ДвоичныеДанныеMCR(Данные);
		//ЗаписываемыеДанные = Новый ХранилищеЗначения(ДвоичныеДанныеMCR, Новый СжатиеДанных(9));
		//
		//НС.ХранилищеДвоичныхДанных	=	ЗаписываемыеДанные;
		//НС.Наименование =	Представление;			
		//НС.Запись	=	СтрШаблон("%1 : %2",ПараметрыСеанса.текущийПользователь,Формат(ТекущаяДата(),"ДФ=dd/MM/yy"));		
		//НС.Идентификатор	=	мИдентификатор;		
		//НС.Записать();	
		//
		//Результат	=	Истина;
		
	КонецЕсли; 	
	
	возврат Результат;
	
КонецФункции

//вызывается из консоли запросов
//возврат запроса
Функция ЗагрузитьДанные(СсылкаНаЗапрос, УникальныйИдентификатор) Экспорт
	
	Результат	=	Неопределено;
	
	//Результат = УКО_MCRФорматВызовСервера.Прочитать(СсылкаНаЗапрос.ХранилищеДвоичныхДанных.Получить(), УникальныйИдентификатор);
	//Если Результат.Количество()>0 Тогда
	//	Для Каждого ТекЭлемента из Результат Цикл
	//		ТекЭлемента.Name	=	СокрЛП(СсылкаНаЗапрос.Наименование);				
	//	КонецЦикла;		
	//КонецЕсли;	
	
	Возврат Результат;
	
КонецФункции



#КонецОбласти
